app/Controllers/Profile.php

    public function index(): string
    {
        $user = (new UserModel())->first();
---
SELECT *
FROM `users`
 LIMIT 1