app/Controllers/Tasks.php

SELECT *
FROM `tasks`
WHERE `task_date` = '2026-10-03'
ORDER BY `id` ASC
---
    public function today(): string
    {
        $today = date('Y-m-d');
        $tasks = (new TaskModel())->where('task_date', $today)->orderBy('id', 'ASC')->findAll();

SELECT *
FROM `tasks`
ORDER BY `task_date` ASC, `id` ASC
---
    public function index(): string
    {
        $tasks = (new TaskModel())->orderBy('task_date', 'ASC')->orderBy('id', 'ASC')->findAll();